# DLDBeginLoadData

## Description
Begin creation of load data from that type.

```pascal
PROCEDURE DLDBeginLoadData(loadDataType : INTEGER);
```

```python

def vs.DLDBeginLoadData(loadDataType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|loadDataType|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis